---
kind: type
id: T:Autodesk.Revit.UI.PushButtonData
zh: 按钮
source: html/a192ae26-cdca-3d36-72cb-51074ccd9fec.htm
---
# Autodesk.Revit.UI.PushButtonData

**中文**: 按钮

This class contains information necessary to construct a push button in the Ribbon.

## Syntax (C#)
```csharp
public class PushButtonData : ButtonData
```